In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
pd.set_option("display.max_columns", None)
pd.set_option("display.float_format", lambda x: "%.2f" % x)

In [ ]:
# Soru 1: persona.csv dosyasını okutunuz ve veri seti ile ilgili genel bilgileri gösteriniz.
# Soru 2: Kaç unique SOURCE vardır? Frekansları nedir?
# Soru 3: Kaç unique PRICE vardır?
# Soru 4: Hangi PRICE'dan kaçar tane satış gerçekleşmiş?
# Soru 5: Hangi ülkeden kaçar tane satış olmuş?
# Soru 6: Ülkelere göre satışlardan toplam ne kadar kazanılmış?
# Soru 7: SOURCE türlerine göre satış sayıları nedir?
# Soru 8: Ülkelere göre PRICE ortalamaları nedir?
# Soru 9: SOURCE'lara göre PRICE ortalamaları nedir?
# Soru 10: COUNTRY-SOURCE kırılımında PRICE ortalamaları nedir?

In [2]:
df = pd.read_csv("persona.csv")
df.head()

   PRICE   SOURCE   SEX COUNTRY  AGE
0     39  android  male     bra   17
1     39  android  male     bra   17
2     49  android  male     bra   17
3     29  android  male     tur   17
4     49  android  male     tur   17

In [5]:
print(df.shape)

(5000, 5)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

In [18]:
df["SOURCE"].nunique()

2

In [19]:
df["SOURCE"].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

In [10]:
len(df["PRICE"].unique())

6

In [20]:
df["PRICE"].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

In [22]:
df.groupby("COUNTRY").agg({"PRICE": "count"})

         PRICE
COUNTRY
bra       1496
can        230
deu        455
fra        303
tur        451
usa       2065

In [23]:
df.groupby(by="COUNTRY").agg({"PRICE": "sum"})

         PRICE
COUNTRY
bra      51354
can       7730
deu      15485
fra      10177
tur      15689
usa      70225

In [26]:
df["SOURCE"].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

In [27]:
df.groupby("COUNTRY").agg({"PRICE": "mean"})

         PRICE
COUNTRY
bra      34.33
can      33.61
deu      34.03
fra      33.59
tur      34.79
usa      34.01

In [28]:
df.groupby("SOURCE").agg({"PRICE": "mean"})

         PRICE
SOURCE
android  34.17
ios      34.07

In [29]:
df.groupby(["COUNTRY", "SOURCE"]).agg({"PRICE": "mean"})

                 PRICE
COUNTRY SOURCE
bra     android  34.39
        ios      34.22
can     android  33.33
        ios      33.95
deu     android  33.87
        ios      34.27
fra     android  34.31
        ios      32.78
tur     android  36.23
        ios      33.27
usa     android  33.76
        ios      34.37

GÖREV 2: COUNTRY, SOURCE, SEX, AGE kırılımında ortalama kazançlar nedir?

In [31]:
df.groupby(["COUNTRY", "SOURCE", "SEX", "AGE"]).agg({"PRICE": "mean"}).head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.71
                       16   35.94
                       17   35.67
                       18   32.26
                       19   35.21

Görev 3: Çıktıyı PRICE’a göre sıralayınız. Çıktıyı agg_df olarak kaydediniz.

In [35]:
agg_df = df.groupby(["COUNTRY", "SOURCE", "SEX", "AGE"]).agg({"PRICE": "mean"}).sort_values("PRICE", ascending=False)

In [36]:
agg_df.head()

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46   59.00
usa     android male   36   59.00
fra     android female 24   59.00
usa     ios     male   32   54.00
deu     android female 36   49.00

GÖREV 4: Indekste yer alan isimleri değişken ismine çeviriniz.
         # Üçüncü sorunun çıktısında yer alan PRICE dışındaki tüm değişkenler index isimleridir.
         # Bu isimleri değişken isimlerine çeviriniz.

In [37]:
agg_df=agg_df.reset_index()

In [38]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46  59.00
1     usa  android    male   36  59.00
2     fra  android  female   24  59.00
3     usa      ios    male   32  54.00
4     deu  android  female   36  49.00

GÖREV 5: AGE değişkenini kategorik değişkene çeviriniz ve agg_df'e ekleyiniz.
        # Age sayısal değişkenini kategorik değişkene çeviriniz.
        # Aralıkları ikna edici olacağını düşündüğünüz şekilde oluşturunuz.
        # Örneğin: '0_18', '19_23', '24_30', '31_40', '41_70'

In [42]:
bins = [0, 18, 23, 30, 40, agg_df["AGE"].max()]
labels = ['0_18', '19_23', '24_30', '31_40', '41_70']

agg_df["AGE_CAT"] = pd.cut(agg_df["AGE"], bins, labels=labels)

agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT
0     bra  android    male   46  59.00   41_70
1     usa  android    male   36  59.00   31_40
2     fra  android  female   24  59.00   24_30
3     usa      ios    male   32  54.00   31_40
4     deu  android  female   36  49.00   31_40

In [ ]:
GÖREV 6: Yeni level based müşterileri tanımlayınız ve veri setine değişken olarak ekleyiniz.
#############################################
# customers_level_based adında bir değişken tanımlayınız ve veri setine bu değişkeni ekleyiniz.
# Dikkat!
# list comp ile customers_level_based değerleri oluşturulduktan sonra bu değerlerin tekilleştirilmesi gerekmektedir.
# Örneğin birden fazla şu ifadeden olabilir: USA_ANDROID_MALE_0_18
# Bunları groupby'a alıp price ortalamalarını almak gerekmektedir.

In [44]:
agg_df["CUSTOMER_LEVEL_BASED"] = agg_df[["COUNTRY", "SOURCE", "SEX", "AGE_CAT"]].agg(lambda x: "_".join(x).upper(), axis=1)

In [46]:
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE AGE_CAT      CUSTOMER_LEVEL_BASED
0     bra  android    male   46  59.00   41_70    BRA_ANDROID_MALE_41_70
1     usa  android    male   36  59.00   31_40    USA_ANDROID_MALE_31_40
2     fra  android  female   24  59.00   24_30  FRA_ANDROID_FEMALE_24_30
3     usa      ios    male   32  54.00   31_40        USA_IOS_MALE_31_40
4     deu  android  female   36  49.00   31_40  DEU_ANDROID_FEMALE_31_40

In [ ]:
GÖREV 7: Yeni müşterileri (personaları) segmentlere ayırınız.
#############################################
# PRICE'a göre segmentlere ayırınız,
# segmentleri "SEGMENT" isimlendirmesi ile agg_df'e ekleyiniz,
# segmentleri betimleyiniz (Segmentlere göre group by yapıp price mean, max, sum’larını alınız).

In [53]:
agg_df["SEGMENT"] = pd.qcut(agg_df["PRICE"], 4, labels=["D", "C", "B", "A"])
agg_df.head()

,COUNTRY,SOURCE,SEX,AGE,PRICE,AGE_CAT,CUSTOMER_LEVEL_BASED,SEGMENT
0,bra,android,male,46,59.00,41_70,BRA_ANDROID_MALE_41_70,A
1,usa,android,male,36,59.00,31_40,USA_ANDROID_MALE_31_40,A
2,fra,android,female,24,59.00,24_30,FRA_ANDROID_FEMALE_24_30,A
3,usa,ios,male,32,54.00,31_40,USA_IOS_MALE_31_40,A
4,deu,android,female,36,49.00,31_40,DEU_ANDROID_FEMALE_31_40,A

In [56]:
agg_df.groupby("SEGMENT").agg({"PRICE": ["mean", "max", "sum"]})

        PRICE
         mean   max     sum
SEGMENT
D       27.30 31.11 2375.33
C       32.93 34.00 3128.67
B       35.44 37.00 2870.33
A       41.43 59.00 3521.95

Görev 8: Yeni gelen müşterileri sınıflandırıp, ne kadar gelir getirebileceklerini tahmin ediniz.
    • 33 yaşında ANDROID kullanan bir Türk kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?
    • 35 yaşında IOS kullanan bir Fransız kadını hangi segmente aittir ve ortalama ne kadar gelir kazandırması beklenir?

In [57]:
new_user = "TUR_ANDROID_FEMALE_31_40"
agg_df[agg_df["CUSTOMER_LEVEL_BASED"] == new_user]

,COUNTRY,SOURCE,SEX,AGE,PRICE,AGE_CAT,CUSTOMER_LEVEL_BASED,SEGMENT
18,tur,android,female,32,43.00,31_40,TUR_ANDROID_FEMALE_31_40,A
35,tur,android,female,31,40.67,31_40,TUR_ANDROID_FEMALE_31_40,A

In [59]:
new_user = "FRA_IOS_FEMALE_31_40"
agg_df[agg_df["CUSTOMER_LEVEL_BASED"] == new_user]

    COUNTRY SOURCE     SEX  AGE  PRICE AGE_CAT  CUSTOMER_LEVEL_BASED SEGMENT
208     fra    ios  female   40  33.00   31_40  FRA_IOS_FEMALE_31_40       C
221     fra    ios  female   31  32.64   31_40  FRA_IOS_FEMALE_31_40       C